# Дана длина ребра куба a. Найти объем куба V = a^3 и площадь его поверхности S = 6 * a^2.

a = float(input("Введите длину ребра куба a: "))

V = a ** 3
S = 6 * (a ** 2)

print("Объем куба V =", V)
print("Площадь поверхности куба S =", S)