# Дан диаметр окружности d. Найти ее длину L = π * d. В качестве значения π использовать 3.14.

d = float(input("Введите диаметр окружности: "))
pi = 3.14
L = pi * d
print("Длина окружности:", L)