# Дана сторона квадрата a. Найти его периметр P = 4 * a.

a = float(input("Введите сторону квадрата a: "))
P = 4 * a
print("Периметр квадрата:", P)